/******************************************************************************
** 版权:     杭州利尔达科技有限公司
** 文件名:   Timer_A_B.c
** 工作环境: IAR 4.11B 
** 作者:    Gufeng 
** 生成日期: 2008.12
** 功能:     TA1、TA2、TB3、TB4分别输出PWM波，让LED灯闪烁
** 相关文件:
** 修改日志：
*******************************************************************************/
#include  <msp430x26x.h>
/*************************************************************************
** 函数名称：主函数
** 工作环境: IAR 4.11B 
** 作者:     谷丰
** 生成日期: 2008.12.10
** 功能:     TA、TB基本配置，PWM波输出
** 相关文件:
** 修改日志：
*************************************************************************/
void main( void )
{

  WDTCTL = WDTPW + WDTHOLD;
  P2DIR |= BIT3 + BIT4;               // TA选择输出 
  P2SEL |= BIT3 + BIT4;               // IO口选择第二功能
  P4DIR |= BIT2 + BIT3;               // TB选择输出
  P4SEL |= BIT2 + BIT3;               // IO口选择第二功能
  TACTL |= TASSEL_1 + TACLR;          // 时钟源选择
  TBCTL |= TBSSEL_1 + TBCLR;          // 时钟源选择
  TACCR0 = 32768;                     // PWM频率32768/32768 = 1HZ
  TACCR1 = 16384;                     // 占空比50%
  TACCR2 = 16384;                     // 占空比50%
  TBCCR0 = 16384;                     // PWM频率32768/16384 = 2HZ
  TBCCR3 = 8192;                      // 占空比50%
  TBCCR4 = 8192;                      // 占空比50%
  TBCTL |= MC_1;                      // 增计数模式  
  TACTL |= MC_1;                      // 增计数模式
  TACCTL1 |= OUTMOD_2;                // TA1模式2输出
  TACCTL2 |= OUTMOD_4;                // TA2模式4输出            
  TBCCTL3 |= OUTMOD_4;                // TB3模式4输出
  TBCCTL4 |= OUTMOD_2;                // TB4模式2输出
  LPM3;
}
