/*******************************************************************************
// 版权:   杭州利尔达科技有限公司
// 文件名:MSP430F261x_MPY.c
// 版本：V1.0
// 工作环境:IAR Embedded Workbench Evaluation for MSP430 4.10A
// 作者:Huanglongsong 
// 描述：硬件乘法器的操作，实现8X8位的乘法运算，本例程实现乘法、乘加运算，在乘法
//       运算中，MPY放置被乘数，OP2放置乘数，当OP2放完数值后立马启动乘法运算，结
//       果存入RESLO和RELHI中;乘加运算亦同，只是运算结果与上次结果相加作为本次结果！
// 生成日期:2008年11月
//  
//             MSP430F261x
//             -----------------
//         /|\|                 |
//          | |                 |
//          --|RST              |
//            |                 |
//            |                 |
//
//
//
******************************************************************************/
#include  <msp430x26x.h>

void main(void)
{
  WDTCTL = WDTPW+WDTHOLD;                   // 停止开门狗

  MPY = 0x12;                               // 加载被乘数(无符号)
  OP2 = 0x56;                               // 加载乘数,立即启动乘法运算，结果在RESLO、RESHI中

  _BIS_SR(LPM4_bits);                       // LPM4
}
