/*************************************************************************
** 版权:   杭州利尔达科技有限公司
** 文件名:Init_MSP430.c
** 版本：V1.0
** 工作环境:IAR Embedded Workbench Evaluation for MSP430 4.10A
** 作者:Huanglongsong
** 生成日期:2008年12月
** 功能: 初始化MSP430的相关模块
** 相关文件:
** 修改日志
*************************************************************************/
#include <msp430x26x.h>
#include "General_File.h"
/****************************************************************
** 函数名：Init_Port                                               
** 功能：初始化看门狗
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void Init_WDT( void )
{
    WDTCTL = WDT_ADLY_250;
    IE1 |= WDTIE;
}
/****************************************************************
** 函数名：Init_Port                                               
** 功能：初始化系统时钟
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void Init_Port( void )
{   
/***************  液晶接口初始化 ***************************/    
    P4OUT &= ~( BIT4 + BIT3 + BIT6 );
    P4DIR |= BIT4 + BIT3 + BIT6;
    P7DIR |= 0xFF;
    P7OUT =  0xFF;
    P8DIR |= BIT0 + BIT1 + BIT2 + BIT3 +BIT4 + BIT5;
    P8OUT = 0xFF;
/***************  按键端口初始化 *****************************/
    P5OUT &= ~LED_BIT;                             // 用于按键指示
    P5DIR |= LED_BIT;    
    P2REN = 0xff;
    P2IFG = 0;
    P2IES |= BIT0 + BIT1 + BIT4;    //开Right、Left、Up、Down有效
    P2IE  |= BIT0 + BIT1 + BIT4;    //开Right、Left、Up、Down有效
}
/****************************************************************
** 函数名：Init_CLK                                                
** 功能：初始化系统时钟
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void Init_CLK( void )
{
    BCSCTL3 |= XT2S_2;                         // XT2频率范围设置
    BCSCTL1 = CALBC1_12MHZ;                    // 设置DCO的频率范围
    DCOCTL = CALDCO_12MHZ;
    BCSCTL1 |= DIVA_1;                         // ACLK/2
}
/*************************************************************************
函数名：System_Init
入口参数：
出口参数：无
功能：初始化MSP430系统
代码编制：黄龙松
日期：2008年12月
*************************************************************************/
void System_Init( void )
{
    Init_WDT();
    Init_CLK();
    Init_Port();
}