/*****************************************************************
** 版权:   杭州利尔达科技有限公司
** 文件名:Init_MSP430.c
** 版本：V1.0
** 工作环境:IAR Embedded Workbench Evaluation for MSP430 4.10A
** 作者:Huanglongsong
** 描述：MSP430相关函数的定义，配置相关模块的工作模式
** 生成日期:2008年11月
*****************************************************************/
#include "LM35T_Head.h"
/****************************************************************
** 函数名：Init_CLK                                                
** 功能：初始化系统时钟
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void Init_CLK( void )
{
    BCSCTL3 |= XT2S_2;                         // XT2频率范围设置
    BCSCTL1 &= ~XT2OFF;                        // 打开XT2振荡器
    BCSCTL1 |= DIVA_1;                         // ACLK/2
    do
    {
        IFG1 &= ~OFIFG;                        // 清振荡器失效标志
        BCSCTL3 &= ~XT2OF;                     // 清XT2失效标志
        for( uint i = 0x47FF; i > 0; i-- );    // 等待XT2频率稳定
    }while (IFG1 & OFIFG);                     // 外部时钟源正常起动了吗？
    BCSCTL2 |= SELM_2 + SELS + DIVM_1;         // 设置MCLK、SMCLK为XT2 
}
/****************************************************************
** 函数名：Init_Port                                               
** 功能：初始化系统时钟
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void Init_Port( void )
{
    P7DIR |= 0xFF;
    P7OUT =  0xFF;
    P8DIR = 0xFF;
    P8DIR &= ~Wait;
    P8OUT = 0xFF;
}
/*****************************************************************
** 函数名：Init_MCU                                             
** 功能：初始化系统时钟
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void Init_MCU( void )
{
    WDTCTL = WDTPW + WDTHOLD;                 // 关看门狗
    Init_CLK();                               // 初始化时钟                  
    Init_Port();                              // 初始化端口
}
/*****************************************************************
** 函数名：OFF_CPU                                           
** 功能：调用本征函数实现关CPU
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void OFF_CPU( void )
{
    _BIS_SR( CPUOFF );
}
/*****************************************************************
** 函数名：OFF_CPU                                           
** 功能：调用本征函数实现关CPU
** 作者: huanglongsong
** 生成日期: 2008.12
** 相关文件:
** 修改日志：
*****************************************************************/
void OPEN_ISR( void )
{
    _EINT();
}
/**********************************************************************
函数名：Timer_A 
入口参数：无
出口参数：无
功能：定时唤醒CPU
代码编制：黄龙松
日期：2008年12月
***********************************************************************/
#pragma vector = WDT_VECTOR
__interrupt void WDT_Timer(void)
{
    _BIC_SR_IRQ( CPUOFF );
}